SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_spi.h
/**
  * @brief SPI_CCTL Register Bit Definition
  */
#define  SPI_CCTL_CPHA_Pos                        (0)
#define  SPI_CCTL_CPHA_Msk                        (0x1U << SPI_CCTL_CPHA_Pos)                       /*!<Clock phase selection bit*/
#define  SPI_CCTL_CPHA                            SPI_CCTL_CPHA_Msk
#define  SPI_CCTL_CPOL_Pos                        (1)
#define  SPI_CCTL_CPOL_Msk                        (0x1U << SPI_CCTL_CPOL_Pos)                       /*!<Clock polarity flag bit*/
#define  SPI_CCTL_CPOL                            SPI_CCTL_CPOL_Msk
#define  SPI_CCTL_LSBFE_Pos                       (2)
#define  SPI_CCTL_LSBFE_Msk                       (0x1U << SPI_CCTL_LSBFE_Pos)                      /*!<LSBFE:LSB front enable bit*/
#define  SPI_CCTL_LSBFE                           SPI_CCTL_LSBFE_Msk
#define  SPI_CCTL_SPILEN_Pos                      (3)
#define  SPI_CCTL_SPILEN_Msk                      (0x1U << SPI_CCTL_SPILEN_Pos)                     /*!<SPI data width bit*/
#define  SPI_CCTL_SPILEN                          SPI_CCTL_SPILEN_Msk
#define  SPI_CCTL_RXEDGE_Pos                      (4)
#define  SPI_CCTL_RXEDGE_Msk                      (0x1U << SPI_CCTL_RXEDGE_Pos)                     /*!<Receipt data sampling clock edge selection bit (master mode)*/
#define  SPI_CCTL_RXEDGE                          SPI_CCTL_RXEDGE_Msk
#define  SPI_CCTL_TXEDGE_Pos                      (5)
#define  SPI_CCTL_TXEDGE_Msk                      (0x1U << SPI_CCTL_TXEDGE_Pos)                     /*!<Transmission data phase bit adjustment (slave mode)*/
#define  SPI_CCTL_TXEDGE                          SPI_CCTL_TXEDGE_Msk
#define  SPI_CCTL_CPHASEL_Pos                     (6)
#define  SPI_CCTL_CPHASEL_Msk                     (0x1U << SPI_CCTL_CPHASEL_Pos)                    /*!<CPHA polarity inversion selection*/
#define  SPI_CCTL_CPHASEL                         SPI_CCTL_CPHASEL_Msk
#define  SPI_CCTL_TISEL_Pos                       (7)
#define  SPI_CCTL_TISEL_Msk                       (0x1U << SPI_CCTL_TISEL_Pos)                      /*!<TI mode select*/
#define  SPI_CCTL_TISEL                           SPI_CCTL_TISEL_Msk
#define  SPI_CCTL_MRDECHG_Pos                     (8)
#define  SPI_CCTL_MRDECHG_Msk                     (0x7U << SPI_CCTL_MRDECHG_Pos)                    /*!<Receive data edge change*/
#define  SPI_CCTL_MRDECHG                         SPI_CCTL_MRDECHG_Msk
#define  SPI_CCTL_MRDECHG_0                       (0x1U << SPI_CCTL_MRDECHG_Pos) 
#define  SPI_CCTL_MRDECHG_1                       (0x2U << SPI_CCTL_MRDECHG_Pos) 
#define  SPI_CCTL_MRDECHG_2                       (0x4U << SPI_CCTL_MRDECHG_Pos) 

/**
  * @brief SPI_SPBRG Register Bit Definition
  */
#define  SPI_SPBRG_SPBRG_Pos                      (0)
#define  SPI_SPBRG_SPBRG_Msk                      (0xFFFFU << SPI_SPBRG_SPBRG_Pos)                  /*!<SPI baud rate control register for baud rate*/
#define  SPI_SPBRG_SPBRG                          SPI_SPBRG_SPBRG_Msk
#define  SPI_SPBRG_SPBRG_0                        (0x0001U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_1                        (0x0002U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_2                        (0x0004U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_3                        (0x0008U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_4                        (0x0010U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_5                        (0x0020U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_6                        (0x0040U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_7                        (0x0080U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_8                        (0x0100U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_9                        (0x0200U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_10                       (0x0400U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_11                       (0x0800U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_12                       (0x1000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_13                       (0x2000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_14                       (0x4000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_15                       (0x8000U << SPI_SPBRG_SPBRG_Pos) 

/**
  * @brief SPI_RXDNR Register Bit Definition
  */
#define  SPI_RXDNR_RXDNR_Pos                      (0)
#define  SPI_RXDNR_RXDNR_Msk                      (0xFFFFU << SPI_RXDNR_RXDNR_Pos)                  /*!<The register is used to hold a count of to be received in the next receipt process*/
#define  SPI_RXDNR_RXDNR                          SPI_RXDNR_RXDNR_Msk
#define  SPI_RXDNR_RXDNR_0                        (0x0001U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_1                        (0x0002U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_2                        (0x0004U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_3                        (0x0008U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_4                        (0x0010U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_5                        (0x0020U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_6                        (0x0040U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_7                        (0x0080U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_8                        (0x0100U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_9                        (0x0200U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_10                       (0x0400U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_11                       (0x0800U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_12                       (0x1000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_13                       (0x2000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_14                       (0x4000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_15                       (0x8000U << SPI_RXDNR_RXDNR_Pos) 

/**
  * @brief SPI_NSSR Register Bit Definition
  */
#define  SPI_NSSR_NSS_Pos                         (0)
#define  SPI_NSSR_NSS_Msk                         (0x1U << SPI_NSSR_NSS_Pos)                        /*!<The chip selection output signal in the master mode. Low valid, the bit is invalid in the slave mode*/
#define  SPI_NSSR_NSS                             SPI_NSSR_NSS_Msk

/**
  * @brief SPI_EXTCTL Register Bit Definition
  */
#define  SPI_EXTCTL_EXTLEN_Pos                    (0)
#define  SPI_EXTCTL_EXTLEN_Msk                    (0x1FU << SPI_EXTCTL_EXTLEN_Pos)                  /*!<Control SPI data length*/
#define  SPI_EXTCTL_EXTLEN                        SPI_EXTCTL_EXTLEN_Msk
#define  SPI_EXTCTL_EXTLEN_0                      (0x01U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_1                      (0x02U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_2                      (0x04U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_3                      (0x08U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_4                      (0x10U << SPI_EXTCTL_EXTLEN_Pos) 

/**
  * @brief SPI_I2SCFGR Register Bit Definition
  */
#define  SPI_I2SCFGR_CHLEN_Pos                    (0)
#define  SPI_I2SCFGR_CHLEN_Msk                    (0x1U << SPI_I2SCFGR_CHLEN_Pos)                   /*!<Audio length (data bit number contained in each audio)*/
#define  SPI_I2SCFGR_CHLEN                        SPI_I2SCFGR_CHLEN_Msk
#define  SPI_I2SCFGR_DATLEN_Pos                   (1)
#define  SPI_I2SCFGR_DATLEN_Msk                   (0x3U << SPI_I2SCFGR_DATLEN_Pos)                  /*!<Data length*/
#define  SPI_I2SCFGR_DATLEN                       SPI_I2SCFGR_DATLEN_Msk
#define  SPI_I2SCFGR_DATLEN_0                     (0x1U << SPI_I2SCFGR_DATLEN_Pos) 
#define  SPI_I2SCFGR_DATLEN_1                     (0x2U << SPI_I2SCFGR_DATLEN_Pos) 
#define  SPI_I2SCFGR_I2SSTD_Pos                   (4)
#define  SPI_I2SCFGR_I2SSTD_Msk                   (0x3U << SPI_I2SCFGR_I2SSTD_Pos)                  /*!<I2S standard*/
#define  SPI_I2SCFGR_I2SSTD                       SPI_I2SCFGR_I2SSTD_Msk
#define  SPI_I2SCFGR_I2SSTD_0                     (0x1U << SPI_I2SCFGR_I2SSTD_Pos) 
#define  SPI_I2SCFGR_I2SSTD_1                     (0x2U << SPI_I2SCFGR_I2SSTD_Pos) 
#define  SPI_I2SCFGR_PCMSYNC_Pos                  (6)
#define  SPI_I2SCFGR_PCMSYNC_Msk                  (0x1U << SPI_I2SCFGR_PCMSYNC_Pos)                 /*!<PCM standard frame sync mode*/
#define  SPI_I2SCFGR_PCMSYNC                      SPI_I2SCFGR_PCMSYNC_Msk
#define  SPI_I2SCFGR_SPI_I2S_Pos                  (10)
#define  SPI_I2SCFGR_SPI_I2S_Msk                  (0x1U << SPI_I2SCFGR_SPI_I2S_Pos)                 /*!<Module function selection*/
#define  SPI_I2SCFGR_SPI_I2S                      SPI_I2SCFGR_SPI_I2S_Msk
#define  SPI_I2SCFGR_MCKOE_Pos                    (11)
#define  SPI_I2SCFGR_MCKOE_Msk                    (0x1U << SPI_I2SCFGR_MCKOE_Pos)                   /*!<MCK clock output enable*/
#define  SPI_I2SCFGR_MCKOE                        SPI_I2SCFGR_MCKOE_Msk
#define  SPI_I2SCFGR_MCKSEL_Pos                   (12)
#define  SPI_I2SCFGR_MCKSEL_Msk                   (0x1U << SPI_I2SCFGR_MCKSEL_Pos)                  /*!<*/
#define  SPI_I2SCFGR_MCKSEL                       SPI_I2SCFGR_MCKSEL_Msk
#define  SPI_I2SCFGR_HDSEL_Pos                    (13)
#define  SPI_I2SCFGR_HDSEL_Msk                    (0x1U << SPI_I2SCFGR_HDSEL_Pos)                   /*!<*/
#define  SPI_I2SCFGR_HDSEL                        SPI_I2SCFGR_HDSEL_Msk
#define  SPI_I2SCFGR_I2SDIV_Pos                   (16)
#define  SPI_I2SCFGR_I2SDIV_Msk                   (0x1FFU << SPI_I2SCFGR_I2SDIV_Pos)                /*!<I2S prescaler division factor*/
#define  SPI_I2SCFGR_I2SDIV                       SPI_I2SCFGR_I2SDIV_Msk
#define  SPI_I2SCFGR_I2SDIV_0                     (0x001U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_1                     (0x002U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_2                     (0x004U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_3                     (0x008U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_4                     (0x010U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_5                     (0x020U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_6                     (0x040U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_7                     (0x080U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_8                     (0x100U << SPI_I2SCFGR_I2SDIV_Pos) 

#endif

